j20-immigration/content/post/taxpayers.md
+++
title = "Why should taxpayers foot the bill for a sanctuary state?"
author = ["Hawaii J20"]
date = 2018-07-02T18:56:00-10:00
lastmod = 2018-08-04T18:04:09-10:00
draft = false
[menu.main]
  weight = 2014
  identifier = "why-should-taxpayers-foot-the-bill-for-a-sanctuary-state"
+++

## Question: {#question}

Why should taxpayers bear the burden of supporting undocumented aliens?


## Background: {#background}

Immigration is a federal function that citizens support with the money they pay
in taxes to the Internal Revenue Service. However, the federal government
routinely deputizes local law enforcement agents to assist in immigration
enforcement, even though the federal government does not provide funding to
local governments for this purpose. This cooperation means local taxpayers
effectively pay twice for immigration enforcement -- once with their federal
taxes, and again with their state and local taxes.

Here in Hawai\`i local law enforcement agents routinely cooperate with federal
agencies on immigration issues. One common request, a warrant-less detainer,
asks local law enforcement agents to hold an arrested undocumented immigrant at
OCCC for 48 hours longer than the allowable 24 hours. Federal judges in other
districts have ruled these warrant-less detainers are unlawful. The direct cost
to Hawai\`i taxpayers for the cooperation of our local law enforcement agents
over the last 10 years has been estimated at $300,000. In addition, holding
immigrants on warrant-less detainers contributes to the overcrowding of OCCC, a
facility already bursting at the seams.


## Answer: {#answer}

A state sanctuary bill will save Hawai\`i taxpayers money by refusing to honor
requests for non-public information and warrant-less detainers issued by ICE.
Taxpayers will not have to pay twice for immigration enforcement.
